import { useState, useEffect } from "react";

const usePattern = (category) => {
  const [arr, setArr] = useState([]);

  useEffect(() => {
    switch (category) {
      case "field":
        setArr([
          `(배우|연출|극작|기획|보컬|랩|댄스|연기|가수|무용|모델|연주|아이돌)`,
        ]);
        break;

      case "period":
        setArr([
          `(\\d{4})?(년|\\.|-|)( |)([1-9]|0[1-9]|1[012])(월|\\.|-)( |)([12][0-9]|3[01]|[1-9]|0[1-9])(일 |일|\\.| )?(\\((월|화|수|목|금|토|일)(요일)?\\))?(부터| ~| -) (\\d{4})?(년|\\.|-|)( |)([1-9]|0[1-9]|1[012])(월|\\.|-)( |)([12][0-9]|3[01]|[1-9]|0[1-9])(일까지|일 |일|\\.| )?(\\((월|화|수|목|금|토|일)(요일)?\\))?`,
        ]);
        break;

      case "age":
        setArr([
          `(\\d{4} ~ \\d{4}|(최소나이 )?(만 )?\\d+세( 이하)?|(\\d{4}|\\d{2})년생(부터 \\d{4}년생까지)?)`,
        ]);
        break;

      case "gender":
        setArr([
          `(남성|여성|남자|여자|모두|남녀|누구나|무관|(?<=[^가-힣])남(?=[^가-힣])|(?<=[^가-힣])여(?=[^가-힣]))`,
        ]);
        break;

      case "contact":
        setArr([
          `([\\w-\\.]+@([\\w-]+\\.)+[\\w-]{2,4}$|탤런티드|현장|구글폼|홈페이지|현장접수|카카오톡|온라인|인스타그램)`,
        ]);
        break;

      case "url":
        setArr([
          `(https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|www\\.[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9]+\\.[^\\s]{2,}|www\\.[a-zA-Z0-9]+\\.[^\\s]{2,})`,
        ]);

      default:
        break;
    }
  }, []);

  return arr;
};

export default usePattern;
