import { useState, useEffect } from "react";

const usePattern = (category) => {
  const [arr, setArr] = useState([]);

  useEffect(() => {
    switch (category) {
      case "field":
        setArr([
          `(배우|연출|극작|기획|보컬|랩|댄스|연기|가수|무용|모델|연주|아이돌)`,
        ]);
        break;

      case "period":
        setArr([
          `((\\d{4}(년|\\.|-|\\/)( |))?([1-9]|0[1-9]|1[012])(월|\\.|-|\\/)( |)([12][0-9]|3[01]|[1-9]|0[1-9])(일 |일|\\.| )?(\\((월|화|수|목|금|토|일)(요일)?\\))?(부터( |)|( |)~( |)|( |)-( |))(\\d{4}(년|\\.|-|\\/)( |))?([1-9]|0[1-9]|1[012])(월|\\.|-|\\/)( |)([12][0-9]|3[01]|[1-9]|0[1-9])(일까지|일 |일|\\.| )?(\\((월|화|수|목|금|토|일)(요일)?\\))?|상시(모집)?)`,
        ]);
        break;

      case "age":
        setArr([
          `(\\d{4}(년생|년)?( |)(~|-)( |)\\d{4}(년생|년)?|(최소나이 )?(만 )?\\d+세( 이하)?|(\\d{4}|\\d{2})년생(부터 \\d{4}년생까지)?|\\d{2}대|\\d{2}( |)(~|-)( |)\\d{2}(대|세))`,
        ]);
        break;

      case "gender":
        setArr([
          `((?<=[^가-힣])(남성|남자|남)((?=[^가-힣]))|(?<=[^가-힣])(여성|여자|여)(?=[^가-힣])|남녀|누구나|무관)`,
        ]);
        break;

      case "qualification":
        setArr([`(지원자격|자격요건)`]);
        break;

      case "contact":
        setArr([
          `([\\w-\\.]+@([\\w-]+\.)+[\\w-]{2,3}|탤런티드|현장|구글폼|홈페이지|현장접수|카카오톡|온라인|인스타그램|문자)`,
        ]);
        break;

      case "url":
        setArr([
          `(https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|www\\.[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\\.[^\\s]{2,}|https?:\\/\\/(?:www\\.|(?!www))[a-zA-Z0-9]+\\.[^\\s]{2,}|www\\.[a-zA-Z0-9]+\\.[^\\s]{2,})`,
        ]);

      default:
        break;
    }
  }, []);

  return arr;
};

export default usePattern;
